Python 3.12.6 (tags/v3.12.6:a4a2d2b, Sep  6 2024, 20:11:23) [MSC v.1940 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Введіть ціле число: 2
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Введіть ціле число: 3
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Введіть десятковий дріб: 2.3
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Введіть десятковий дріб: 3.2
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
5

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
-0.9000000000000004

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
6.8999999999999995

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
1.6

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
4.924577653379664

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
0.0

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
0.20000000000000018

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Список з результатами дій: 5 -0.9 6.8 1.6 4.92 0.0 0.20
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Кількість елементів списку: 7
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Список парних елементів з попереднього списка: -0.9, 1.6, 0.0:

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Список із зміненними елементами: [5, 4.92, 6.8, 1.6, -0.9, 0.0, 0.2]

================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Введіть імʼя: Катерина Кіцак
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
Введіть групу 291; 
  
================== RESTART: C:/Users/Катеріна/Desktop/pr 1.py ==================
>>> Лабораторну роботу номер 1 виконала Кіцак Катерина, студентка групи 291.Висновок: на даній лабораторній роботі було проведено повторення та ознайомлення з основами мови програмування Python.Виконано базові дії над операторами та функціями данної мови програмування.Роботу виконано в повному обсязі

